Autodesk.Revit.DB.PaperPlacementType
An enumerated type listing all Paper Placement types of Print Setting.

Autodesk.Revit.DB.PaperPlacementType.Margins
The type of Paper Placement is Margins.

Autodesk.Revit.DB.PaperPlacementType.Center
The type of Paper Placement is Center.